## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.system_status_static_site_root_certificate will be created
  + resource "aws_acm_certificate" "system_status_static_site_root_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "status.staging.notification.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "status.staging.notification.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.system_status_static_site[0] will be created
  + resource "aws_acm_certificate_validation" "system_status_static_site" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.system_status_static_site[0] will be created
  + resource "aws_route53_record" "system_status_static_site" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # module.system_status_static_site.aws_cloudfront_origin_access_identity.simple_static_website will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      - caller_reference                = "terraform-20240610183439928400000001" -> null
      - cloudfront_access_identity_path = "origin-access-identity/cloudfront/EJEOF7E7KZMQ2" -> null
      - comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz" -> null
      - etag                            = "E2N5UJ6GQC2ARY" -> null
      - iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EJEOF7E7KZMQ2" -> null
      - id                              = "EJEOF7E7KZMQ2" -> null
      - s3_canonical_user_id            = "2035e2229cc77a5b7fbb2549382034f6a10632da9f3a5d9ded893868fceac96e0f2195f91eea2815930f29603338936a" -> null
    }

  # module.system_status_static_site.aws_s3_bucket.this will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> null
      - bucket                      = "notification-canada-ca-staging-system-status" -> null
      - bucket_domain_name          = "notification-canada-ca-staging-system-status.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "notification-canada-ca-staging-system-status" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EJEOF7E7KZMQ2"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint            = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.system_status_static_site.aws_s3_bucket_policy.oai_policy will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket_policy" "oai_policy" {
      - bucket = "notification-canada-ca-staging-system-status" -> null
      - id     = "notification-canada-ca-staging-system-status" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EJEOF7E7KZMQ2"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.system_status_static_site.aws_s3_bucket_public_access_block.this will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "notification-canada-ca-staging-system-status" -> null
      - id                      = "notification-canada-ca-staging-system-status" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.system_status_static_site.aws_s3_bucket_website_configuration.this will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "this" {
      - bucket           = "notification-canada-ca-staging-system-status" -> null
      - id               = "notification-canada-ca-staging-system-status" -> null
      - website_domain   = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # module.system_status_static_site.random_string.suffix will be destroyed
  # (because module.system_status_static_site is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "7nnqojnz" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "7nnqojnz" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.system_status_static_site[0].data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site[0].aws_cloudfront_origin_access_identity.simple_static_website will be created
  + resource "aws_cloudfront_origin_access_identity" "simple_static_website" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Allow CloudFront to reach the S3 bucket for domain status.staging.notification.cdssandbox.xyz"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.system_status_static_site[0].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-staging-system-status"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy will be created
  + resource "aws_s3_bucket_policy" "oai_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.system_status_static_site[0].aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.system_status_static_site[0].aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.system_status_static_site[0].random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 9 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ system_status_static_site_bucket_id     = "notification-canada-ca-staging-system-status" -> (known after apply)
  ~ system_status_static_site_bucket_name   = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> (known after apply)
  ~ system_status_static_site_bucket_region = "ca-central-1" -> (known after apply)

Error: Invalid count argument

  on .terraform/modules/system_status_static_site/simple_static_website/acm.tf line 2, in resource "aws_acm_certificate" "cloudfront":
   2:   count    = local.is_create_certificate ? 1 : 0

The "count" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the count depends on.
time=2024-06-10T19:25:01Z level=error msg=Terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/staging/system_status_static_site/.terragrunt-cache/-8x46wHx7k-VUfpslMnRXx1u9mA/ziUKr5pa_JoeDZ3wgSbieuIpHJE/system_status_static_site prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/system_status_static_site] 
time=2024-06-10T19:25:01Z level=error msg=1 error occurred:
	* exit status 1



```

</details>

